Module ЗаполнитьРедакторСлушателя

    Sub ЗаполнитьРедакторСлушателя()
        Dim Массив
        Массив = ФормаСправочникСлушатели.ИнформацияОСлушателе
        Try
            РедакторСлушателя.Снилс.Text = ДобавитьРубашку.ДобавитьРубашку(ФормаСправочникСлушатели.ИнформацияОСлушателе(1, 0)).ToString
        Catch ex As Exception
            предупреждение.текст.Text = "Ошибка. Некорректный СНИЛС в базе. Необходима ручная проверка базы!"
            Exit Sub
            РедакторСлушателя.Close()
            ОткрытьФорму(предупреждение)
        End Try

        РедакторСлушателя.Фамилия.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(2, 0).ToString
        РедакторСлушателя.Имя.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(3, 0).ToString
        РедакторСлушателя.Отчество.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(4, 0).ToString
        Try
            РедакторСлушателя.ДатаРождения.Value = ФормаСправочникСлушатели.ИнформацияОСлушателе(5, 0)
        Catch ex As Exception

        End Try
        РедакторСлушателя.Пол.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(6, 0).ToString
        РедакторСлушателя.УровеньОбразования.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(7, 0).ToString
        РедакторСлушателя.Образование.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(8, 0).ToString
        РедакторСлушателя.СерияДокументаООбразовании.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(9, 0).ToString
        РедакторСлушателя.НомерДокументаООбразовании.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(10, 0).ToString
        РедакторСлушателя.ФамилияВДокОбОбразовании.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(11, 0).ToString
        РедакторСлушателя.АдресРегистрации.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(12, 0).ToString
        Try
            РедакторСлушателя.Телефон.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(13, 0).ToString
        Catch ex As Exception

        End Try
        РедакторСлушателя.Гражданство.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(14, 0).ToString
        РедакторСлушателя.ДУЛ.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(15, 0).ToString
        РедакторСлушателя.СерияДУЛ.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(16, 0).ToString
        РедакторСлушателя.НомерДУЛ.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(17, 0).ToString
        РедакторСлушателя.ИсточникФин.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(18, 0).ToString
        РедакторСлушателя.НаправившаяОрг.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(19, 0).ToString
        Try
            РедакторСлушателя.ДатаНаправленияРосздравнвдзора.Value = ФормаСправочникСлушатели.ИнформацияОСлушателе(21, 0).ToString
        Catch ex As Exception

        End Try

        РедакторСлушателя.НомерНаправленияРосздравнадзора.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(20, 0).ToString

        РедакторСлушателя.Email.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(25, 0).ToString

        Try
            РедакторСлушателя.ДатаВыдачиДУЛ.Value = ФормаСправочникСлушатели.ИнформацияОСлушателе(28, 0).ToString
        Catch ex As Exception

        End Try

        РедакторСлушателя.КемВыданДУЛ.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(27, 0).ToString
        РедакторСлушателя.doo_vid_dok.Text = ФормаСправочникСлушатели.ИнформацияОСлушателе(29, 0).ToString

    End Sub

End Module
